OpenNuvoton/M55M1BSP/Library/StdDriver/src/hsusbd.c
/**************************************************************************//**
 * @file     hsusbd.c
 * @version  V1.00
 * @brief    HSUSBD driver source file
 *
 * @copyright SPDX-License-Identifier: Apache-2.0
 * @copyright Copyright (C) 2023 Nuvoton Technology Corp. All rights reserved.
*****************************************************************************/

#include "NuMicro.h"

/** @addtogroup Standard_Driver Standard Driver
  @{
*/

/** @addtogroup HSUSBD_Driver HSUSBD Driver
  @{
*/

/** @addtogroup HSUSBD_EXPORTED_FUNCTIONS HSUSBD Exported Functions
  @{
*/

/*--------------------------------------------------------------------------*/
/** @cond HIDDEN_SYMBOLS */
/* Global variables for Control Pipe */
S_HSUSBD_CMD_T gUsbCmd;
S_HSUSBD_INFO_T *g_hsusbd_sInfo;

HSUSBD_VENDOR_REQ g_hsusbd_pfnVendorRequest = ((void *)0);
HSUSBD_CLASS_REQ g_hsusbd_pfnClassRequest = ((void *)0);
HSUSBD_SET_INTERFACE_REQ g_hsusbd_pfnSetInterface = ((void *)0);
uint32_t g_u32HsEpStallLock = 0UL;       /* Bit map flag to lock specified EP when SET_FEATURE */

static uint8_t *g_hsusbd_CtrlInPointer = ((void *)0);
static uint32_t g_hsusbd_CtrlMaxPktSize = 64UL;
static uint8_t g_hsusbd_UsbConfig = 0U;
static uint8_t g_hsusbd_EnableTestMode = 0U;
static uint8_t g_hsusbd_TestSelector = 0U;

volatile uint8_t g_hsusbd_RemoteWakeupEn = 0U;

uint8_t volatile g_hsusbd_Configured = 0U;
uint8_t g_hsusbd_CtrlZero = 0U;
uint8_t g_hsusbd_UsbAddr = 0U;
uint8_t g_hsusbd_ShortPacket = 0U;
uint32_t volatile g_hsusbd_DmaDone = 0UL;
uint32_t g_hsusbd_CtrlInSize = 0UL;
/** @endcond HIDDEN_SYMBOLS */

/**
 * @brief       HSUSBD Initial
 *
 * @param[in]   param               Descriptor
 * @param[in]   pfnClassReq         Class Request Callback Function
 * @param[in]   pfnSetInterface     SetInterface Request Callback Function
 *
 * @retval      HSUSBD_OK           HSUSBD operation OK.
 * @retval      HSUSBD_ERR_TIMEOUT  HSUSBD operation abort due to timeout error.
 *
 * @details     This function is used to initial HSUSBD.
 */
int32_t HSUSBD_Open(S_HSUSBD_INFO_T *param, HSUSBD_CLASS_REQ pfnClassReq, HSUSBD_SET_INTERFACE_REQ pfnSetInterface)
{
    uint32_t u32TimeOutCnt;

    g_hsusbd_sInfo = param;
    g_hsusbd_pfnClassRequest = pfnClassReq;
    g_hsusbd_pfnSetInterface = pfnSetInterface;

    /* get EP0 maximum packet size */
    g_hsusbd_CtrlMaxPktSize = g_hsusbd_sInfo->gu8DevDesc[7];

    /* Initial USB engine */
    HSUSBD_ENABLE_PHY();

    /* wait PHY clock ready */
    u32TimeOutCnt = HSUSBD_TIMEOUT;

    while (!(HSUSBD->PHYCTL & HSUSBD_PHYCTL_PHYCLKSTB_Msk))
    {
        if (--u32TimeOutCnt == 0)
        {
            return HSUSBD_ERR_TIMEOUT;
        }
    }

    HSUSBD->OPER &= ~HSUSBD_OPER_HISPDEN_Msk;   /* full-speed */

    return HSUSBD_OK;
}

/**
 * @brief       HSUSBD Start
 *
 * @param[in]   None
 *
 * @return      None
 *
 * @details     This function is used to start transfer
 */
void HSUSBD_Start(void)
{
    HSUSBD->OPER = HSUSBD_OPER_HISPDEN_Msk;   /* High-speed */
    HSUSBD_CLR_SE0();
    HSUSBD->OPER |= HSUSBD_OPER_HISHSEN_Msk;  /* Start high speed handshake*/
}

/**
 * @brief       Process Setup Packet
 *
 * @param[in]   None
 *
 * @return      None
 *
 * @details     This function is used to process Setup packet.
 */
void HSUSBD_ProcessSetupPacket(void)
{
    /* Setup packet process */
    gUsbCmd.bmRequestType = (uint8_t)(HSUSBD->SETUP1_0 & 0xffUL);
    gUsbCmd.bRequest = (uint8_t)((HSUSBD->SETUP1_0 >> 8) & 0xffUL);
    gUsbCmd.wValue = (uint16_t)HSUSBD->SETUP3_2;
    gUsbCmd.wIndex = (uint16_t)HSUSBD->SETUP5_4;
    gUsbCmd.wLength = (uint16_t)HSUSBD->SETUP7_6;

    /* USB device request in setup packet: offset 0, D[6..5]: 0=Standard, 1=Class, 2=Vendor, 3=Reserved */
    switch (gUsbCmd.bmRequestType & 0x60UL)
    {
        case REQ_STANDARD:
        {
            HSUSBD_StandardRequest();
            break;
        }

        case REQ_CLASS:
        {
            if (g_hsusbd_pfnClassRequest != ((void *)0))
            {
                g_hsusbd_pfnClassRequest();
            }

            break;
        }

        case REQ_VENDOR:
        {
            if (g_hsusbd_pfnVendorRequest != ((void *)0))
            {
                g_hsusbd_pfnVendorRequest();
            }

            break;
        }

        default:
        {
            /* Setup error, stall the device */
            HSUSBD_SET_CEP_STATE(HSUSBD_CEPCTL_STALLEN_Msk);
            break;
        }
    }
}

/**
 * @brief       Get Descriptor request
 *
 * @param[in]   None
 *
 * @return      None
 *
 * @details     This function is used to process GetDescriptor request.
 */
static int HSUSBD_GetDescriptor(void)
{
    uint32_t u32Len;
    int val = 0;

    u32Len = gUsbCmd.wLength;
    g_hsusbd_CtrlZero = (uint8_t)0UL;

    switch ((gUsbCmd.wValue & 0xff00UL) >> 8)
    {
        /* Get Device Descriptor */
        case DESC_DEVICE:
        {
            u32Len = Minimum(u32Len, LEN_DEVICE);
            HSUSBD_PrepareCtrlIn((uint8_t *)g_hsusbd_sInfo->gu8DevDesc, u32Len);
            break;
        }

        /* Get Configuration Descriptor */
        case DESC_CONFIG:
        {
            uint32_t u32TotalLen;

            if ((HSUSBD->OPER & 0x04UL) == 0x04UL)
            {
                u32TotalLen = g_hsusbd_sInfo->gu8ConfigDesc[3];
                u32TotalLen = g_hsusbd_sInfo->gu8ConfigDesc[2] + (u32TotalLen << 8);

                if (u32Len > u32TotalLen)
                {
                    u32Len = u32TotalLen;

                    if ((u32Len % g_hsusbd_CtrlMaxPktSize) == 0UL)
                    {
                        g_hsusbd_CtrlZero = (uint8_t)1UL;
                    }
                }

                HSUSBD_PrepareCtrlIn((uint8_t *)g_hsusbd_sInfo->gu8ConfigDesc, u32Len);
            }
            else
            {
                u32TotalLen = g_hsusbd_sInfo->gu8FullConfigDesc[3];
                u32TotalLen = g_hsusbd_sInfo->gu8FullConfigDesc[2] + (u32TotalLen << 8);

                if (u32Len > u32TotalLen)
                {
                    u32Len = u32TotalLen;

