OpenNuvoton/M55M1BSP/Library/StdDriver/src/hsusbd.c
                    if ((u32Len % g_hsusbd_CtrlMaxPktSize) == 0UL)
                    {
                        g_hsusbd_CtrlZero = (uint8_t)1UL;
                    }
                }

                HSUSBD_PrepareCtrlIn((uint8_t *)g_hsusbd_sInfo->gu8FullConfigDesc, u32Len);
            }

            break;
        }

#ifdef SUPPORT_LPM

        /* Get BOS Descriptor */
        case DESC_BOS:
        {
            if (g_hsusbd_sInfo->gu8BosDesc == 0)
            {
                HSUSBD_SET_CEP_STATE(HSUSBD_CEPCTL_STALLEN_Msk);
            }
            else
            {
                u32Len = Minimum(u32Len, LEN_BOS + LEN_BOSCAP);
                HSUSBD_PrepareCtrlIn((uint8_t *)g_hsusbd_sInfo->gu8BosDesc, u32Len);
            }

            break;
        }

#endif

        /* Get Qualifier Descriptor */
        case DESC_QUALIFIER:
        {
            u32Len = Minimum(u32Len, LEN_QUALIFIER);
            HSUSBD_PrepareCtrlIn((uint8_t *)g_hsusbd_sInfo->gu8QualDesc, u32Len);
            break;
        }

        /* Get Other Speed Descriptor - Full speed */
        case DESC_OTHERSPEED:
        {
            uint32_t u32TotalLen;

            if ((HSUSBD->OPER & 0x04UL) == 0x04UL)
            {
                u32TotalLen = g_hsusbd_sInfo->gu8HSOtherConfigDesc[3];
                u32TotalLen = g_hsusbd_sInfo->gu8HSOtherConfigDesc[2] + (u32TotalLen << 8);

                if (u32Len > u32TotalLen)
                {
                    u32Len = u32TotalLen;

                    if ((u32Len % g_hsusbd_CtrlMaxPktSize) == 0UL)
                    {
                        g_hsusbd_CtrlZero = (uint8_t)1UL;
                    }
                }

                HSUSBD_PrepareCtrlIn((uint8_t *)g_hsusbd_sInfo->gu8HSOtherConfigDesc, u32Len);
            }
            else
            {
                u32TotalLen = g_hsusbd_sInfo->gu8FSOtherConfigDesc[3];
                u32TotalLen = g_hsusbd_sInfo->gu8FSOtherConfigDesc[2] + (u32TotalLen << 8);

                if (u32Len > u32TotalLen)
                {
                    u32Len = u32TotalLen;

                    if ((u32Len % g_hsusbd_CtrlMaxPktSize) == 0UL)
                    {
                        g_hsusbd_CtrlZero = (uint8_t)1UL;
                    }
                }

                HSUSBD_PrepareCtrlIn((uint8_t *)g_hsusbd_sInfo->gu8FSOtherConfigDesc, u32Len);
            }

            break;
        }

        /* Get HID Descriptor */
        case DESC_HID:
        {
            uint32_t u32ConfigDescOffset;   /* u32ConfigDescOffset is configuration descriptor offset (HID descriptor start index) */
            u32Len = Minimum(u32Len, LEN_HID);
            u32ConfigDescOffset = g_hsusbd_sInfo->gu32ConfigHidDescIdx[gUsbCmd.wIndex & 0xffUL];
            HSUSBD_PrepareCtrlIn((uint8_t *)&g_hsusbd_sInfo->gu8ConfigDesc[u32ConfigDescOffset], u32Len);
            break;
        }

        /* Get Report Descriptor */
        case DESC_HID_RPT:
        {
            if (u32Len > g_hsusbd_sInfo->gu32HidReportSize[gUsbCmd.wIndex & 0xffUL])
            {
                u32Len = g_hsusbd_sInfo->gu32HidReportSize[gUsbCmd.wIndex & 0xffUL];

                if ((u32Len % g_hsusbd_CtrlMaxPktSize) == 0UL)
                {
                    g_hsusbd_CtrlZero = (uint8_t)1UL;
                }
            }

            HSUSBD_PrepareCtrlIn((uint8_t *)g_hsusbd_sInfo->gu8HidReportDesc[gUsbCmd.wIndex & 0xffUL], u32Len);
            break;
        }

        /* Get String Descriptor */
        case DESC_STRING:
        {
            if ((gUsbCmd.wValue & 0xffUL) < 8UL)
            {
                if (u32Len > g_hsusbd_sInfo->gu8StringDesc[gUsbCmd.wValue & 0xffUL][0])
                {
                    u32Len = g_hsusbd_sInfo->gu8StringDesc[gUsbCmd.wValue & 0xffUL][0];

                    if ((u32Len % g_hsusbd_CtrlMaxPktSize) == 0UL)
                    {
                        g_hsusbd_CtrlZero = (uint8_t)1UL;
                    }
                }

                HSUSBD_PrepareCtrlIn((uint8_t *)g_hsusbd_sInfo->gu8StringDesc[gUsbCmd.wValue & 0xffUL], u32Len);
            }
            else
            {
                HSUSBD_SET_CEP_STATE(HSUSBD_CEPCTL_STALLEN_Msk);
                val = 1;
            }

            break;
        }

        default:
            /* Not support. Reply STALL. */
            HSUSBD_SET_CEP_STATE(HSUSBD_CEPCTL_STALLEN_Msk);
            val = 1;
            break;
    }

    return val;
}


/**
 * @brief       Process USB standard request
 *
 * @param[in]   None
 *
 * @return      None
 *
 * @details     This function is used to process USB Standard Request.
 */
void HSUSBD_StandardRequest(void)
{
    static uint8_t s_hsusbd_UsbAltInterface = 0U;
    /* clear global variables for new request */
    g_hsusbd_CtrlInPointer = ((void *)0);
    g_hsusbd_CtrlInSize = 0UL;

    if ((gUsbCmd.bmRequestType & 0x80UL) == 0x80UL)   /* request data transfer direction */
    {
        /* Device to host */
        switch (gUsbCmd.bRequest)
        {
            case GET_CONFIGURATION:
            {
                /* Return current configuration setting */
                HSUSBD_PrepareCtrlIn((uint8_t *)&g_hsusbd_UsbConfig, 1UL);

                HSUSBD_CLR_CEP_INT_FLAG(HSUSBD_CEPINTSTS_INTKIF_Msk);
                HSUSBD_ENABLE_CEP_INT(HSUSBD_CEPINTEN_INTKIEN_Msk);
                break;
            }

            case GET_DESCRIPTOR:
            {
                if (!HSUSBD_GetDescriptor())
                {
                    HSUSBD_CLR_CEP_INT_FLAG(HSUSBD_CEPINTSTS_INTKIF_Msk);
                    HSUSBD_ENABLE_CEP_INT(HSUSBD_CEPINTEN_INTKIEN_Msk);
                }

                break;
            }

            case GET_INTERFACE:
            {
                /* Return current interface setting */
                HSUSBD_PrepareCtrlIn((uint8_t *)&s_hsusbd_UsbAltInterface, 1UL);

                HSUSBD_CLR_CEP_INT_FLAG(HSUSBD_CEPINTSTS_INTKIF_Msk);
                HSUSBD_ENABLE_CEP_INT(HSUSBD_CEPINTEN_INTKIEN_Msk);
                break;
            }

            case GET_STATUS:
            {
                uint8_t buf[2];

                /* Device */
                if (gUsbCmd.bmRequestType == 0x80UL)
                {
                    uint8_t u8Tmp;

                    u8Tmp = (uint8_t)0UL;

                    if ((g_hsusbd_sInfo->gu8ConfigDesc[7] & 0x40UL) == 0x40UL)
                    {
                        u8Tmp |= (uint8_t)1UL; /* Self-Powered/Bus-Powered */
                    }

                    if ((g_hsusbd_sInfo->gu8ConfigDesc[7] & 0x20UL) == 0x20UL)
                    {
                        u8Tmp |= (uint8_t)(g_hsusbd_RemoteWakeupEn << 1UL); /* Remote wake up */
                    }

                    buf[0] = u8Tmp;
                }
                /* Interface */
                else if (gUsbCmd.bmRequestType == 0x81UL)
                {
                    buf[0] = (uint8_t)0UL;
                }
                /* Endpoint */
                else if (gUsbCmd.bmRequestType == 0x82UL)
                {
                    uint8_t ep = (uint8_t)(gUsbCmd.wIndex & 0xfUL);
                    buf[0] = (uint8_t)HSUSBD_GetStall((uint32_t)ep) ? (uint8_t)1 : (uint8_t)0;
                }
                else
                {
                    /* Not Supported */
                }

