OpenNuvoton/M55M1BSP/Library/StdDriver/src/hsusbd.c
                buf[1] = (uint8_t)0UL;
                HSUSBD_PrepareCtrlIn(buf, 2UL);
                HSUSBD_CLR_CEP_INT_FLAG(HSUSBD_CEPINTSTS_INTKIF_Msk);
                HSUSBD_ENABLE_CEP_INT(HSUSBD_CEPINTEN_INTKIEN_Msk);
                break;
            }

            default:
            {
                /* Setup error, stall the device */
                HSUSBD_SET_CEP_STATE(HSUSBD_CEPCTL_STALLEN_Msk);
                break;
            }
        }
    }
    else
    {
        /* Host to device */
        switch (gUsbCmd.bRequest)
        {
            case CLEAR_FEATURE:
            {
                if ((gUsbCmd.wValue & 0xffUL) == FEATURE_ENDPOINT_HALT)
                {
                    /* EP number stall is not allow to be clear in MSC class "Error Recovery Test".
                       a flag: g_u32HsEpStallLock is added to support it */
                    uint32_t epNum = (uint32_t)(gUsbCmd.wIndex & 0xfUL);

                    for (uint32_t i = 0UL; i < HSUSBD_MAX_EP; i++)
                    {
                        if ((((HSUSBD->EP[i].EPCFG & 0xf0UL) >> 4) == epNum) && ((g_u32HsEpStallLock & (1UL << i)) == 0UL))
                        {
                            HSUSBD->EP[i].EPRSPCTL = (HSUSBD->EP[i].EPRSPCTL & 0xefUL) | HSUSBD_EP_RSPCTL_TOGGLE;
                        }
                    }
                }
                else if ((gUsbCmd.wValue & 0xffUL) == FEATURE_DEVICE_REMOTE_WAKEUP)
                {
                    g_hsusbd_RemoteWakeupEn = (uint8_t)0UL;
                }
                else
                {
                    /* Not Supported */
                }

                /* Status stage */
                HSUSBD_CLR_CEP_INT_FLAG(HSUSBD_CEPINTSTS_STSDONEIF_Msk);
                HSUSBD_SET_CEP_STATE(HSUSBD_CEPCTL_NAKCLR);
                HSUSBD_ENABLE_CEP_INT(HSUSBD_CEPINTEN_STSDONEIEN_Msk);
                break;
            }

            case SET_ADDRESS:
            {
                g_hsusbd_UsbAddr = (uint8_t)gUsbCmd.wValue;
                /* Status Stage */
                HSUSBD_CLR_CEP_INT_FLAG(HSUSBD_CEPINTSTS_STSDONEIF_Msk);
                HSUSBD_SET_CEP_STATE(HSUSBD_CEPCTL_NAKCLR);
                HSUSBD_ENABLE_CEP_INT(HSUSBD_CEPINTEN_STSDONEIEN_Msk);
                break;
            }

            case SET_CONFIGURATION:
            {
                g_hsusbd_UsbConfig = (uint8_t)gUsbCmd.wValue;
                g_hsusbd_Configured = (uint8_t)1UL;
                /* Status stage */
                HSUSBD_CLR_CEP_INT_FLAG(HSUSBD_CEPINTSTS_STSDONEIF_Msk);
                HSUSBD_SET_CEP_STATE(HSUSBD_CEPCTL_NAKCLR);
                HSUSBD_ENABLE_CEP_INT(HSUSBD_CEPINTEN_STSDONEIEN_Msk);
                break;
            }

            case SET_FEATURE:
            {
                if ((gUsbCmd.wValue & 0x3UL) == 2UL)    /* TEST_MODE */
                {
                    g_hsusbd_EnableTestMode = (uint8_t)1UL;
                    g_hsusbd_TestSelector = (uint8_t)(gUsbCmd.wIndex >> 8);
                }

                if ((gUsbCmd.wValue & 0x3UL) == 3UL)    /* HNP ebable */
                {
                    HSOTG->CTL |= (HSOTG_CTL_HNPREQEN_Msk | HSOTG_CTL_BUSREQ_Msk);
                }

                if ((gUsbCmd.wValue & FEATURE_DEVICE_REMOTE_WAKEUP) == FEATURE_DEVICE_REMOTE_WAKEUP)   /* REMOTE_WAKEUP ebable */
                {
                    g_hsusbd_RemoteWakeupEn = (uint8_t)1UL;
                }

                /* Status stage */
                HSUSBD_CLR_CEP_INT_FLAG(HSUSBD_CEPINTSTS_STSDONEIF_Msk);
                HSUSBD_SET_CEP_STATE(HSUSBD_CEPCTL_NAKCLR);
                HSUSBD_ENABLE_CEP_INT(HSUSBD_CEPINTEN_STSDONEIEN_Msk);
                break;
            }

            case SET_INTERFACE:
            {
                s_hsusbd_UsbAltInterface = (uint8_t)gUsbCmd.wValue;

                if (g_hsusbd_pfnSetInterface != ((void *)0))
                {
                    g_hsusbd_pfnSetInterface((uint32_t)s_hsusbd_UsbAltInterface);
                }

                /* Status stage */
                HSUSBD_CLR_CEP_INT_FLAG(HSUSBD_CEPINTSTS_STSDONEIF_Msk);
                HSUSBD_SET_CEP_STATE(HSUSBD_CEPCTL_NAKCLR);
                HSUSBD_ENABLE_CEP_INT(HSUSBD_CEPINTEN_STSDONEIEN_Msk);
                break;
            }

            default:
            {
                /* Setup error, stall the device */
                HSUSBD_SET_CEP_STATE(HSUSBD_CEPCTL_STALLEN_Msk);
                break;
            }
        }
    }
}

/**
 * @brief       Update Device State
 *
 * @param[in]   None
 *
 * @return      None
 *
 * @details     This function is used to update Device state when Setup packet complete
 */
/** @cond HIDDEN_SYMBOLS */
#define TEST_J                  0x01UL
#define TEST_K                  0x02UL
#define TEST_SE0_NAK            0x03UL
#define TEST_PACKET             0x04UL
#define TEST_FORCE_ENABLE       0x05UL
/** @endcond HIDDEN_SYMBOLS */

void HSUSBD_UpdateDeviceState(void)
{
    switch (gUsbCmd.bRequest)
    {
        case SET_ADDRESS:
        {
            HSUSBD_SET_ADDR(g_hsusbd_UsbAddr);
            break;
        }

        case SET_CONFIGURATION:
        {
            if (g_hsusbd_UsbConfig == 0UL)
            {
                uint32_t volatile i;

                /* Reset PID DATA0 */
                for (i = 0UL; i < HSUSBD_MAX_EP; i++)
                {
                    if ((HSUSBD->EP[i].EPCFG & 0x1UL) == 0x1UL)
                    {
                        HSUSBD->EP[i].EPRSPCTL = HSUSBD_EP_RSPCTL_TOGGLE;
                    }
                }
            }

            break;
        }

        case SET_FEATURE:
        {
            if (gUsbCmd.wValue == FEATURE_ENDPOINT_HALT)
            {
                uint32_t idx;
                idx = (uint32_t)(gUsbCmd.wIndex & 0xfUL);
                HSUSBD_SetStall(idx);
            }
            else if (g_hsusbd_EnableTestMode)
            {
                g_hsusbd_EnableTestMode = (uint8_t)0UL;

                if (g_hsusbd_TestSelector == TEST_J)
                {
                    HSUSBD->TEST = TEST_J;
                }
                else if (g_hsusbd_TestSelector == TEST_K)
                {
                    HSUSBD->TEST = TEST_K;
                }
                else if (g_hsusbd_TestSelector == TEST_SE0_NAK)
                {
                    HSUSBD->TEST = TEST_SE0_NAK;
                }
                else if (g_hsusbd_TestSelector == TEST_PACKET)
                {
                    HSUSBD->TEST = TEST_PACKET;
                }
                else if (g_hsusbd_TestSelector == TEST_FORCE_ENABLE)
                {
                    HSUSBD->TEST = TEST_FORCE_ENABLE;
                }
                else
                {
                    /* Not Supported */
                }
            }
            else
            {
                /* Not Supported */
            }

            if ((gUsbCmd.wValue & FEATURE_DEVICE_REMOTE_WAKEUP) == FEATURE_DEVICE_REMOTE_WAKEUP)
            {
                g_hsusbd_RemoteWakeupEn = (uint8_t)1UL;
            }

            break;
        }

        case CLEAR_FEATURE:
        {
            if (gUsbCmd.wValue == FEATURE_ENDPOINT_HALT)
            {
                uint32_t idx;
                idx = (uint32_t)(gUsbCmd.wIndex & 0xfUL);
                HSUSBD_ClearStall(idx);
            }
            else if (gUsbCmd.wValue == FEATURE_DEVICE_REMOTE_WAKEUP)
            {
                g_hsusbd_RemoteWakeupEn = (uint8_t)0UL;
            }
            else
            {
                /* Not Supported */
            }

            break;
        }

        default:
            break;
    }
}


/**
 * @brief       Prepare Control IN transaction
 *
 * @param[in]   pu8Buf      Control IN data pointer
 * @param[in]   u32Size     IN transfer size
 *
 * @return      None
 *
 * @details     This function is used to prepare Control IN transfer
 */
void HSUSBD_PrepareCtrlIn(uint8_t pu8Buf[], uint32_t u32Size)
{
    g_hsusbd_CtrlInPointer = pu8Buf;
    g_hsusbd_CtrlInSize = u32Size;
}



/**
 * @brief       Start Control IN transfer
 *
 * @param[in]   None
 *
 * @return      None
 *
 * @details     This function is used to start Control IN
 */
void HSUSBD_CtrlIn(void)
{
    uint32_t i;
    uint32_t cnt;

