OpenNuvoton/M55M1BSP/Library/StdDriver/src/hsusbd.c
    if (g_hsusbd_CtrlInSize >= g_hsusbd_CtrlMaxPktSize)
    {
        /* Data size > MXPLD */
        cnt = g_hsusbd_CtrlMaxPktSize >> 2;

        for (i = 0UL; i < cnt; i++)
        {
            HSUSBD->CEPDAT = *(uint32_t *)g_hsusbd_CtrlInPointer;
            g_hsusbd_CtrlInPointer = (uint8_t *)((uintptr_t)g_hsusbd_CtrlInPointer + 4UL);
        }

        HSUSBD_START_CEP_IN(g_hsusbd_CtrlMaxPktSize);
        g_hsusbd_CtrlInSize -= g_hsusbd_CtrlMaxPktSize;
    }
    else
    {
        /* Data size <= MXPLD */
        cnt = g_hsusbd_CtrlInSize;

        for (i = 0UL; i < cnt; i++)
        {
            uint8_t u8Value = *(uint8_t *)((uintptr_t)g_hsusbd_CtrlInPointer + i);
            outpb(&HSUSBD->CEPDAT, u8Value);
        }

        HSUSBD_START_CEP_IN(g_hsusbd_CtrlInSize);
        g_hsusbd_CtrlInPointer = ((void *)0);
        g_hsusbd_CtrlInSize = 0UL;
    }
}

/**
 * @brief       Start Control OUT transaction
 *
 * @param[in]   pu8Buf      Control OUT data pointer
 * @param[in]   u32Size     OUT transfer size
 *
 * @retval      HSUSBD_OK           HSUSBD operation OK.
 * @retval      HSUSBD_ERR_TIMEOUT  HSUSBD operation abort due to timeout error.
 *
 * @details     This function is used to start Control OUT transfer
 */
int32_t HSUSBD_CtrlOut(uint8_t pu8Buf[], uint32_t u32Size)
{
    uint32_t i;
    uint32_t u32TimeOutCnt = HSUSBD_TIMEOUT;

    while (1)
    {
        if ((HSUSBD->CEPINTSTS & HSUSBD_CEPINTSTS_RXPKIF_Msk) == HSUSBD_CEPINTSTS_RXPKIF_Msk)
        {
            for (i = 0UL; i < u32Size; i++)
            {
                pu8Buf[i] = inpb(&HSUSBD->CEPDAT);
            }

            HSUSBD->CEPINTSTS = HSUSBD_CEPINTSTS_RXPKIF_Msk;
            break;
        }

        if (--u32TimeOutCnt == 0)
        {
            return HSUSBD_ERR_TIMEOUT;
        }
    }

    return HSUSBD_OK;
}

/**
 * @brief       Clear all software flags
 *
 * @param[in]   None
 *
 * @return      None
 *
 * @details     This function is used to clear all software control flag
 */
void HSUSBD_SwReset(void)
{
    /* Reset all variables for protocol */
    g_hsusbd_UsbAddr = (uint8_t)0UL;
    g_hsusbd_DmaDone = 0UL;
    g_hsusbd_ShortPacket = (uint8_t)0UL;
    g_hsusbd_Configured = (uint8_t)0UL;

    /* Reset USB device address */
    HSUSBD_SET_ADDR(0UL);
}

/**
 * @brief       HSUSBD Set Vendor Request
 *
 * @param[in]   pfnVendorReq         Vendor Request Callback Function
 *
 * @return      None
 *
 * @details     This function is used to set HSUSBD vendor request callback function
 */
void HSUSBD_SetVendorRequest(HSUSBD_VENDOR_REQ pfnVendorReq)
{
    g_hsusbd_pfnVendorRequest = pfnVendorReq;
}

/** @} end of group HSUSBD_EXPORTED_FUNCTIONS */

/** @} end of group HSUSBD_Driver */

/** @} end of group Standard_Driver */
